#include "PhaseDetector.h"

// ============================================================
// TURN ZONE
// ============================================================

bool PhaseDetector::inTurnZone(float valRawAngle)
{
    // --------------------------------------------------------
    // ZONE 1
    // --------------------------------------------------------
    //
    // Положение около 0° / 360°.
    //

    if (valRawAngle >= 350.0f ||
        valRawAngle <= 10.0f)
    {
        return true;
    }

    // --------------------------------------------------------
    // ZONE 2
    // --------------------------------------------------------
    //
    // Положение около 180°.
    //

    if (valRawAngle >= 170.0f &&
        valRawAngle <= 190.0f)
    {
        return true;
    }

    return false;
}